html/scheme/stream.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>流式计算</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">流式计算</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org44a269b">流</a>
<ul>
<li><a href="#orgc425158">延迟序列</a>
<ul>
<li><a href="#org55caeca">delay形式</a>
<ul>
<li><a href="#org78969e7">流计算实例</a></li>
</ul>
</li>
<li><a href="#orge0bb14c">延迟求值</a></li>
<li><a href="#org2023add">基本操作实现</a>
<ul>
<li><a href="#org995f506">记忆器</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb08a513">无穷流</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
在用状态和赋值模拟的代码中，可以看到 <span class="underline">赋值带来的复杂性</span> 。实际上，这里的复杂性的根源是 <b>现实世界中被模拟的现象</b> ：
</p>
<ul class="org-ul">
<li>用有 <span class="underline">局部状态的计算对象</span> 模拟 <span class="underline">真实中的状态可能变化的对象</span></li>
<li>用 <span class="underline">计算机里的系统随着时间的变化</span> 模拟 <span class="underline">现实世界中的变化</span></li>
<li>通过对 <span class="underline">有局部状态的对象的赋值</span> ，实现 <span class="underline">计算机系统里的状态变化</span></li>
</ul>


<p>
现在考虑另一种思路：把 <b>一个随时间变化的量表示为一个随时间变化的函数 x(t)</b> 。这样可得到两个层面的观察：
</p>
<ol class="org-ol">
<li>如果看 <span class="underline">x</span> 在一系列具体时刻的值，它是一个 <b>随时间变化的变量</b></li>
<li>如果看 <span class="underline">x</span> 的整个历史，它就是一个 <b>时间的函数，并没有变化</b></li>
</ol>

<p>
对于离散时间上的函数 <span class="underline">x(t)</span> ，由于是离散时间的函数，可以用无穷长的序列模拟。这种序列称为 <span class="underline">流</span> 。流被用来 <b>模拟状态的变化</b> ， <b>模拟一个系统随时间变化的历史</b> 
</p>

<div id="outline-container-org44a269b" class="outline-2">
<h2 id="org44a269b">流</h2>
<div class="outline-text-2" id="text-org44a269b">
<p>
为了做这种模拟，需要引进一种数据结构，也被称为 <span class="underline">stream</span> ：
</p>
<ul class="org-ul">
<li><b>不能直接用表结构</b> 表示流，因为一般说流可能是 <b>无穷的</b></li>
<li>下面采用 <span class="underline">延时求值</span> 技术，用流表示任意长的序列</li>
</ul>

<pre class="example">
    流技术可用于模拟一些包含状态的系统，构造一些有趣模型：

    不需要赋值和变动数据结构，因此可以避免赋值带来的问题
    流不是万能灵药，使用上有本质性困难 
</pre>
</div>
<div id="outline-container-orgc425158" class="outline-3">
<h3 id="orgc425158">延迟序列</h3>
<div class="outline-text-3" id="text-orgc425158">
<p>
如果用 <span class="underline">序列</span> 作为组合程序的标准接口，可以构造了许多有用的序列操作抽象，如 <span class="underline">map</span> , <span class="underline">filter</span> ,  <span class="underline">accumulate</span> 等。比如，用迭代风格计算一个区间中所有素数之和的过程：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">sum-primes</span> a b<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">iter</span> count accum<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> <span style="color: #696969;">((</span>&gt; count b<span style="color: #696969;">)</span> accum<span style="color: #696969;">)</span>
          <span style="color: #696969;">((</span>prime? count<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>iter <span style="color: #696969;">(</span>+ count 1<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>+ count accum<span style="color: #696969;">)))</span>
          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #696969;">(</span>iter <span style="color: #696969;">(</span>+ count 1<span style="color: #696969;">)</span> accum<span style="color: #696969;">))))</span>
  <span style="color: #696969;">(</span>iter a 0<span style="color: #696969;">))</span>
</pre>
</div>

<p>
用序列操作的组合写同样程序：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">sum-primes</span> a b<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>accumulate +
              0
              <span style="color: #696969;">(</span>filter prime? <span style="color: #696969;">(</span>enumerate-interval a b<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
虽然这些抽象用起来很漂亮，但是在得到好结果的同时可能付出 <b>严重的效率代价</b> （空间和或时间），因为 <span class="underline">每步操作都可能构造出很大的数据结构</span> ：
</p>

<p>
第一个程序在计算中 <span class="underline">只维持部分积累和</span> ，而在第二个程序的计算中：
</p>
<ul class="org-ul">
<li><span class="underline">enumerate-interval</span>  构造出区间 <span class="underline">[a,b]</span>  中所有整数的表</li>
<li><span class="underline">filter</span> 基于产生过滤后的表并将其送给 <span class="underline">accumulate</span></li>
</ul>

<p>
实际上两个表都可能很大： 
</p>

<pre class="example">
     清晰性和模块化的代价是效率和资源消耗
</pre>

<p>
另一个极端的例子：求 10000 到 1000000 的区间里的第二个素数，显然效率是极其低效：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>car <span style="color: #696969;">(</span>cdr <span style="color: #696969;">(</span>filter prime?
                  <span style="color: #696969;">(</span>enumerate-interval 10000 1000000<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
流是一种有趣想法，其特点：
</p>
<ul class="org-ul">
<li>支持序列操作同时又能避免用表表示序列的额外代价</li>
<li>程序像操作表一样工作，又有递增计算的高效率</li>
</ul>

<pre class="example">
     流的基本思想：

     做好一种安排，工作中只构造出序列的一部分。仅当程序需要访问序列的尚未构造出来的部分时才去构造它

     程序可以认为整个序列都存在，就像是处理和使用完整的序列
</pre>

<p>
从表面看 <b>流</b> 就像 <span class="underline">表</span> : 
</p>
<ul class="org-ul">
<li>构造函数： <span class="underline">cons-stream</span></li>
<li>选择函数： <span class="underline">stream-car</span> 和 <span class="underline">stream-cdr</span></li>
<li><span class="underline">the-empty-stream</span> :  生成一个特殊的空流，它不能是任何 cons-stream 产生的结果</li>
<li><span class="underline">stream-null?</span> ： 用来判断是否为空</li>
</ul>

<p>
相关操作满足：
</p>
<pre class="example">
(stream-car (cons-stream x y)) = x
(stream-cdr (cons-stream x y)) = y
</pre>

<p>
基于这些基本操作可定义各种序列操作：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">stream-ref</span> s n<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>= n 0<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>stream-car s<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>stream-ref <span style="color: #696969;">(</span>stream-cdr s<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">stream-map</span> proc s<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>stream-null? s<span style="color: #696969;">)</span>
      the-empty-stream
      <span style="color: #696969;">(</span>cons-stream <span style="color: #696969;">(</span>proc <span style="color: #696969;">(</span>stream-car s<span style="color: #696969;">))</span>
                   <span style="color: #696969;">(</span>stream-map proc <span style="color: #696969;">(</span>stream-cdr s<span style="color: #696969;">)))))</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">stream-for-each</span> proc s<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>stream-null? s<span style="color: #696969;">)</span>
      'done
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">begin</span> <span style="color: #696969;">(</span>proc <span style="color: #696969;">(</span>stream-car s<span style="color: #696969;">))</span>
             <span style="color: #696969;">(</span>stream-for-each proc <span style="color: #696969;">(</span>stream-cdr s<span style="color: #696969;">)))))</span>
</pre>
</div>

<p>
stream-for-each 可以用来检查流的每个元素：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">display-stream</span> s<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>stream-for-each display-line s<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">display-line</span> x<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>newline<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>display x<span style="color: #696969;">))</span>
</pre>
</div>

<p>
为了使流的 <span class="underline">构造</span> 和 <span class="underline">使用</span> 能自动而透明地交替进行，实现中需要适当安排：对其 <span class="underline">cdr</span>  部分的求值等到 <b>实际做 <span class="underline">stream-cdr</span> 时</b> 再做，而不是在求值
<span class="underline">cons-stream</span> 时做。作为数据抽象，流和常规表一样，不同点只是 <b>元素的求值时间</b> ：
</p>
<ul class="org-ul">
<li>表的两个成分都在构造时求值</li>
<li>而流的 <span class="underline">cdr</span>  部分推迟到使用时才求值</li>
</ul>
</div>

<div id="outline-container-org55caeca" class="outline-4">
<h4 id="org55caeca">delay形式</h4>
<div class="outline-text-4" id="text-org55caeca">
<p>
流的实现基于特殊形式 <b>delay</b> ：
</p>
<pre class="example">
    求值(delay &lt;e&gt;)  时并不求值 &lt;e&gt;，而是返回一个延时对象
</pre>

<p>
过程 <b>force</b> :  以 <span class="underline">延时对象</span> 为参数，执行对 <span class="underline">&lt;e&gt;</span> 的求值 
</p>

<pre class="example">
(cons-stream &lt;a&gt; &lt;b&gt;)  等价于表达式

(cons &lt;a&gt; (delay &lt;b&gt;))
</pre>

<p>
两个选择函数定义为：
</p>
<div class="org-src-container">
<pre class="src src-scheme">define <span style="color: #696969;">(</span>stream-car stream<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>car stream<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">stream-cdr</span> stream<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">force</span> <span style="color: #696969;">(</span>cdr stream<span style="color: #696969;">)))</span>
</pre>
</div>

<ul class="org-ul">
<li><span class="underline">stream-car</span> : 直接返回 流 的 car</li>
<li><span class="underline">stream-cdr</span> : 得到 流 的 cdr，然后求值这个延迟对象，再返回</li>
</ul>
</div>
