src/scheme/stream.org
**** 流计算实例
     为理解流计算，用流重写求第二个素数的例子，首先用cons-stream 构建 10000 ~ 1000000 的区间：
     #+BEGIN_SRC scheme
  (define (stream-enumerate-interval low high)
    (if (> low high)
	the-empty-stream
	(cons-stream
	 low
	 (stream-enumerate-interval (+ low 1) high))))

  ;; (stream-enumerate-interval 10000 1000000)
  ;; (cons-stream 10000 (stream-enumerate-interval 10001 1000000))
  ;; (cons 10000 (delay (stream-enumerate-interval 10001 1000000)) 
     #+END_SRC

     可以看到  _(stream-enumerate-interval 10000 1000000)_  等价于  _(cons 10000 (delay (stream-enumerate-interval 10001 1000000))_ 

     过滤 _stream_ ：

     #+BEGIN_SRC scheme
  (define (stream-filter pred stream)
    (cond ((stream-null? stream) the-empty-stream)
	  ((pred (stream-car stream))
	   (cons-stream (stream-car stream)
			(stream-filter pred ; 这里并不求值，只是保存求值的表达式
				       (stream-cdr stream))))
	  (else (stream-filter pred (stream-cdr stream)))))
     #+END_SRC

     现在可以把求值第二个素数改写成：

     #+BEGIN_SRC scheme
  (stream-car
   (stream-cdr
    (stream-filter prime? (stream-enumerate-interval 10000 1000000)))) ; => 10009
     #+END_SRC

     + 对 _stream-enumerate-interval_  的调用返回 (cons 10000 (delay (stream-enumerate-interval 10001 1000000)))： 
     #+BEGIN_SRC scheme
  ;; (stream-enumerate-interval 10000 1000000)
  ;; (cons-stream 10000 (stream-enumerate-interval 10001 1000000))
  ;; (cons 10000 (delay (stream-enumerate-interval 10001 1000000)) 
     #+END_SRC

     + _stream-filter_ 检查 _car_ 后丢掉 _10000_ 并迫使流求出序列的下一元素：
     #+BEGIN_SRC scheme
  (stream-filter prime?  (cons 10000 (delay (stream-enumerate-interval 10001 1000000)))) 
  (prime? (stream-car  (cons 10000 (delay (stream-enumerate-interval 10001 1000000))))) 
  (prime? 10000) ; => #f

  (stream-filter prime? (stream-cdr (stream-enumerate-interval 10001 1000000)))
  (stream-filter prime? (force (delay (stream-enumerate-interval 10001 1000000))))
  (stream-filter prime? (stream-enumerate-interval 10001 1000000))
     #+END_SRC

     + 这样丢掉一个一个数直到 stream-filter 最终返回   (cons 10007 (delay (stream-filter prime? (stream-cdr (stream-enumerate-interval 10007 1000000)))))

     #+BEGIN_SRC scheme
  (stream-filter prime? (stream-enumerate-interval 10007 1000000))
  (prime? 10007) ; => #t
  (cons-stream 10007 (stream-filter prime? stream-cdr (stream-enumerate-interval 10007 1000000)))
  (cons 10007 (delay (stream-filter prime? (stream-cdr (stream-enumerate-interval 10007 1000000)))))
     #+END_SRC
     + 调用 stream-cdr 丢掉 10007, 继续求值：
     #+BEGIN_SRC scheme
  (stream-cdr (cons 10007 (delay (stream-filter prime? (stream-cdr (stream-enumerate-interval 10007 1000000))))))
  (force (delay (stream-filter prime? (stream-cdr (stream-enumerate-interval 10007 1000000)))))
  (stream-filter prime? (stream-cdr (stream-enumerate-interval 10007 1000000)))
  (stream-filter prime? (stream-enumerate-interval 10008 1000000)) 
  .....
     #+END_SRC

     + 在得到第二个素数 10009 之后，调用 stream-car 结束计算：

     #+BEGIN_SRC scheme
  (stream-filter prime? (stream-enumerate-interval 10009 1000000))
  (prime 10009) ; => #t
  (cons 10009 (delay (stream-filter prime? (stream-cdr (stream-enumerate-interval 10009 1000000)))))

  (stream-car (cons 10009 (delay (stream-filter prime? (stream-cdr (stream-enumerate-interval 10009 1000000)))))) ; => 10009 
     #+END_SRC

     #+BEGIN_EXAMPLE
       注意：整个序列只展开了前面几项
     #+END_EXAMPLE

*** 延迟求值
    流实现中采用了 *延迟求值* （ _lazy evaluation_ ），直到不得不做的时候再做。与之对应的是主动求值。 _应用序_ 和 _正则序_ 的概念也是上述两个概念的实例。延迟求值可看作“按需计算”，其中 *流成员的计算只做到足够满足需要的那一步* 为止 

    这种做法，解耦了计算过程中 *事件的实际发生顺序* 和 *过程表面结构* 之间的紧密对应关系，因此可能得到 _模块化_ 和 _效率_ 方面的双赢

