html/scheme/stream.html

<div id="outline-container-org78969e7" class="outline-5">
<h5 id="org78969e7">流计算实例</h5>
<div class="outline-text-5" id="text-org78969e7">
<p>
为理解流计算，用流重写求第二个素数的例子，首先用cons-stream 构建 10000 ~ 1000000 的区间：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">stream-enumerate-interval</span> low high<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>&gt; low high<span style="color: #696969;">)</span>
      the-empty-stream
      <span style="color: #696969;">(</span>cons-stream
       low
       <span style="color: #696969;">(</span>stream-enumerate-interval <span style="color: #696969;">(</span>+ low 1<span style="color: #696969;">)</span> high<span style="color: #696969;">))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(stream-enumerate-interval 10000 1000000)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(cons-stream 10000 (stream-enumerate-interval 10001 1000000))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(cons 10000 (delay (stream-enumerate-interval 10001 1000000)) </span>
</pre>
</div>

<p>
可以看到  <span class="underline">(stream-enumerate-interval 10000 1000000)</span>  等价于  <span class="underline">(cons 10000 (delay (stream-enumerate-interval 10001 1000000))</span> 
</p>

<p>
过滤 <span class="underline">stream</span> ：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">stream-filter</span> pred stream<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> <span style="color: #696969;">((</span>stream-null? stream<span style="color: #696969;">)</span> the-empty-stream<span style="color: #696969;">)</span>
        <span style="color: #696969;">((</span>pred <span style="color: #696969;">(</span>stream-car stream<span style="color: #696969;">))</span>
         <span style="color: #696969;">(</span>cons-stream <span style="color: #696969;">(</span>stream-car stream<span style="color: #696969;">)</span>
                      <span style="color: #696969;">(</span>stream-filter pred <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#36825;&#37324;&#24182;&#19981;&#27714;&#20540;&#65292;&#21482;&#26159;&#20445;&#23384;&#27714;&#20540;&#30340;&#34920;&#36798;&#24335;</span>
                                     <span style="color: #696969;">(</span>stream-cdr stream<span style="color: #696969;">))))</span>
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #696969;">(</span>stream-filter pred <span style="color: #696969;">(</span>stream-cdr stream<span style="color: #696969;">)))))</span>
</pre>
</div>

<p>
现在可以把求值第二个素数改写成：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>stream-car
 <span style="color: #696969;">(</span>stream-cdr
  <span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-enumerate-interval 10000 1000000<span style="color: #696969;">))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 10009</span>
</pre>
</div>

<ul class="org-ul">
<li>对 <span class="underline">stream-enumerate-interval</span>  的调用返回 (cons 10000 (delay (stream-enumerate-interval 10001 1000000)))：</li>
</ul>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(stream-enumerate-interval 10000 1000000)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(cons-stream 10000 (stream-enumerate-interval 10001 1000000))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(cons 10000 (delay (stream-enumerate-interval 10001 1000000)) </span>
</pre>
</div>

<ul class="org-ul">
<li><span class="underline">stream-filter</span> 检查 <span class="underline">car</span> 后丢掉 <span class="underline">10000</span> 并迫使流求出序列的下一元素：</li>
</ul>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>stream-filter prime?  <span style="color: #696969;">(</span>cons 10000 <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">delay</span> <span style="color: #696969;">(</span>stream-enumerate-interval 10001 1000000<span style="color: #696969;">))))</span> 
<span style="color: #696969;">(</span>prime? <span style="color: #696969;">(</span>stream-car  <span style="color: #696969;">(</span>cons 10000 <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">delay</span> <span style="color: #696969;">(</span>stream-enumerate-interval 10001 1000000<span style="color: #696969;">)))))</span> 
<span style="color: #696969;">(</span>prime? 10000<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; #f</span>

<span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-cdr <span style="color: #696969;">(</span>stream-enumerate-interval 10001 1000000<span style="color: #696969;">)))</span>
<span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">force</span> <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">delay</span> <span style="color: #696969;">(</span>stream-enumerate-interval 10001 1000000<span style="color: #696969;">))))</span>
<span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-enumerate-interval 10001 1000000<span style="color: #696969;">))</span>
</pre>
</div>

<ul class="org-ul">
<li>这样丢掉一个一个数直到 stream-filter 最终返回   (cons 10007 (delay (stream-filter prime? (stream-cdr (stream-enumerate-interval 10007 1000000)))))</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-enumerate-interval 10007 1000000<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>prime? 10007<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; #t</span>
<span style="color: #696969;">(</span>cons-stream 10007 <span style="color: #696969;">(</span>stream-filter prime? stream-cdr <span style="color: #696969;">(</span>stream-enumerate-interval 10007 1000000<span style="color: #696969;">)))</span>
<span style="color: #696969;">(</span>cons 10007 <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">delay</span> <span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-cdr <span style="color: #696969;">(</span>stream-enumerate-interval 10007 1000000<span style="color: #696969;">)))))</span>
</pre>
</div>
<ul class="org-ul">
<li>调用 stream-cdr 丢掉 10007, 继续求值：</li>
</ul>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>stream-cdr <span style="color: #696969;">(</span>cons 10007 <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">delay</span> <span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-cdr <span style="color: #696969;">(</span>stream-enumerate-interval 10007 1000000<span style="color: #696969;">))))))</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">force</span> <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">delay</span> <span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-cdr <span style="color: #696969;">(</span>stream-enumerate-interval 10007 1000000<span style="color: #696969;">)))))</span>
<span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-cdr <span style="color: #696969;">(</span>stream-enumerate-interval 10007 1000000<span style="color: #696969;">)))</span>
<span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-enumerate-interval 10008 1000000<span style="color: #696969;">))</span> 
.....
</pre>
</div>

<ul class="org-ul">
<li>在得到第二个素数 10009 之后，调用 stream-car 结束计算：</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-enumerate-interval 10009 1000000<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>prime 10009<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; #t</span>
<span style="color: #696969;">(</span>cons 10009 <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">delay</span> <span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-cdr <span style="color: #696969;">(</span>stream-enumerate-interval 10009 1000000<span style="color: #696969;">)))))</span>

<span style="color: #696969;">(</span>stream-car <span style="color: #696969;">(</span>cons 10009 <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">delay</span> <span style="color: #696969;">(</span>stream-filter prime? <span style="color: #696969;">(</span>stream-cdr <span style="color: #696969;">(</span>stream-enumerate-interval 10009 1000000<span style="color: #696969;">))))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 10009 </span>
</pre>
</div>

<pre class="example">
       注意：整个序列只展开了前面几项
</pre>
</div>
</div>
</div>

<div id="outline-container-orge0bb14c" class="outline-4">
<h4 id="orge0bb14c">延迟求值</h4>
<div class="outline-text-4" id="text-orge0bb14c">
<p>
流实现中采用了 <b>延迟求值</b> （ <span class="underline">lazy evaluation</span> ），直到不得不做的时候再做。与之对应的是主动求值。 <span class="underline">应用序</span> 和 <span class="underline">正则序</span> 的概念也是上述两个概念的实例。延迟求值可看作“按需计算”，其中 <b>流成员的计算只做到足够满足需要的那一步</b> 为止 
</p>

<p>
这种做法，解耦了计算过程中 <b>事件的实际发生顺序</b> 和 <b>过程表面结构</b> 之间的紧密对应关系，因此可能得到 <span class="underline">模块化</span> 和 <span class="underline">效率</span> 方面的双赢
</p>
</div>
</div>
